In [ ]:
import MySQLdb
from pandas.io import sql
import pandas as pd
import numpy as np

# Assuming host="localhost", user="root", passwd="MYSQLROOTPASSWORD", db="DBNAME"

con = MySQLdb.connect(host="localhost", user="root", passwd="MYSQLROOTPASSWORD", db="DBNAME") 
cursor = con.cursor()

In [ ]:
# Checking for problematic elements ; (deals with all kinds of spaces)

# name is the concept/drug name & table is the table we're looking at

df_el = pd.read_sql('SELECT  REPLACE(name, ' ', ''), COUNT (REPLACE(name, ' ', '')) FROM Table GROUP BY REPLACE(name, ' ', '') HAVING COUNT (REPLACE(name, ' ', '')) > 1 ', con = conn)

# Printing all such entries with minor typographical differences  and their frequencies 

df_el

In [ ]:
# Deleting records with the same names (Keeping the 0th record)

# We group by modified name strings(removing all spaces) and remove all entries except the lowest d_id for each group

sql = 'DELETE FROM Table WHERE d_id NOT IN (SELECT * FROM (SELECT  MIN(d_id) FROM Table GROUP BY REPLACE(name, ' ', '') HAVING COUNT (REPLACE(name, ' ', ''))))' 

cursor.execute(sql)

con.commit()

print(cursor.rowcount)

In [ ]:
# if the command runs successfully the output should be NULL
df_del = pd.read_sql('SELECT  REPLACE(name, ' ', ''), COUNT (REPLACE(name, ' ', '')) FROM Table GROUP BY REPLACE(name, ' ', '') HAVING COUNT (REPLACE(name, ' ', '')) > 1 ', con = conn)
df_del